Zheng-wan-shun/gd32f330_uart_tx_and_rx/src/driver/drv_systime.c
#include "drv_systime.h"
#include "gd32f3x0.h"
#include "gd32f3x0_timer.h"

volatile unsigned long system_time = 0;

unsigned long drv_millis(void)
{
    return system_time;
}

void drv_delay_us(uint32_t us)
{
    uint32_t ticks;
    uint32_t told;
    uint32_t tnow;
    uint32_t tcnt = 0;
    uint32_t reload;
	
    reload = SysTick->LOAD;
    ticks = us * (SystemCoreClock / 84000000);
    tcnt = 0;
    told = SysTick->VAL;
    while(1)
    {
        tnow = SysTick->VAL;
        if(tnow != told)
        {
            if(tnow < told)
            {
                tcnt += told - tnow;
            }
            else
            {
                tcnt += reload - tnow + told;
            }
            told = tnow;
            if(tcnt >= ticks)
            {
                break;
            }
        }
    }  
}

void drv_delay_ms(unsigned long ms)
{
    unsigned long start_time = drv_millis();
    while((drv_millis() - start_time) <= ms) 
    {
        //do nothing
    }
}

void drv_systime_init(void)
{
    system_time = 0;
    SysTick_Config(SystemCoreClock / 84000);
	  NVIC_SetPriority(SysTick_IRQn, 0x00U);
}

void SysTick_Handler(void)
{
    system_time++;
}
